# FabricWireDistance Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..FabricWireDistance Property
ParameterTypeId Class See Also
---
"Wire distance": The distance between wires
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId FabricWireDistance { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FabricWireDistance As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ FabricWireDistance {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace